Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.cloud_sql[0].google_sql_database_instance.primary will be created
+ resource "google_sql_database_instance" "primary" {
      + connection_name               = (known after apply)
      + database_version              = "SQLSERVER_2017_STANDARD"
      + deletion_protection           = false
      + encryption_key_name           = (known after apply)
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "development-db-eiuvu"
      + private_ip_address            = (known after apply)
      + project                       = "dark-axe-359021"
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + root_password                 = (sensitive value)
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "REGIONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-custom-8-52480"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + start_time                     = "23:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "https://www.googleapis.com/compute/v1/projects/dark-axe-359021/global/networks/development-vpc"
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.linux_nodepool[0].google_container_node_pool.nodepool will be updated in-place
~ resource "google_container_node_pool" "nodepool" {
        id                          = "projects/dark-axe-359021/locations/us-central1/clusters/atlantis-cluster/nodePools/linux-node-pool"
        name                        = "linux-node-pool"
        # (10 unchanged attributes hidden)





      ~ upgrade_settings {
          ~ max_surge       = 1 -> 0
            # (1 unchanged attribute hidden)
        }
        # (4 unchanged blocks hidden)
    }

  # module.nodepool_windows[0].google_container_node_pool.nodepool will be updated in-place
~ resource "google_container_node_pool" "nodepool" {
        id                          = "projects/dark-axe-359021/locations/us-central1/clusters/atlantis-cluster/nodePools/windows-node-pool"
        name                        = "windows-node-pool"
        # (10 unchanged attributes hidden)





      ~ upgrade_settings {
          ~ max_surge       = 1 -> 0
            # (1 unchanged attribute hidden)
        }
        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.cluster.google_container_cluster.cluster,
│   on modules/gke-cluster/main.tf line 46, in resource "google_container_cluster" "cluster":
│   46:   enable_binary_authorization = var.enable_binary_authorization
│ 
│ Deprecated in favor of binary_authorization.
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-vns3s2yxpa-uc.a.run.app/lock?id=mcdermg%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
